app/controllers/genres_controller.rb

	def index
		@genres = Genre.joins(:genres_songs).where('genres_songs.song_id in (?)',params[:song_id])
		@song = Song.find(params[:song_id]);
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_songs" ON "genres_songs"."genre_id" = "genres"."id" INNER JOIN "songs" ON "songs"."id" = "genres_songs"."song_id" WHERE "genres"."song_id" = $1  [["song_id", "1"]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]