app/controllers/songs_controller.rb

	def show
		@song = Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def new
		@user = User.find_by(id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@song = Song.new(song_params)

		if @song.save
---
INSERT INTO "songs" ("name", "created_at", "updated_at", "user_id", "year") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "testing"], ["created_at", "2018-04-18 07:17:57.072237"], ["updated_at", "2018-04-18 07:17:57.072237"], ["user_id", 1], ["year", 1990]]